//======================================================================
//文件名称：key.c
//功能概要：开关构件源文件
//制作单位：赵俊杰
//更新记录：2016-10-16 V1.0
//======================================================================

#include "key.h"	//包含本构件头文件

//=====================================================================
//函数名称：key_init
//函数返回：无
//参数说明：port_pin：(端口号)|(引脚号)（如：(PTB_NUM)|(9) 表示为B口9号脚）
//功能概要：初始化指定端口引脚作为开关功能
//=====================================================================
void key_init(uint_16 port_pin)
{
	//初始化该引脚为GPIO输入功能
	gpio_init(port_pin, GPIO_IN, KEY_OFF);
	//拉高电平，已确保开关未开启时始终获取的是关闭状态
	gpio_pull(port_pin, KEY_OFF);
}

//=====================================================================
//函数名称：key_get
//函数返回：指定开关的状态（KEY_ON(0)或KEY_OFF(1)）
//参数说明：port_pin：(端口号)|(引脚号)（如：(PTB_NUM)|(9) 表示为B口9号脚）
//功能概要：当指定端口引脚被定义为开关功能时，本函数获取指定引脚状态
//=====================================================================
uint_8 key_get(uint_16 port_pin)
{
	return gpio_get(port_pin);
}
